Напиши пожалуйста вьюшку для джанго, которая будет по переданному айдишнику объекта делать следующее:

1) находить все смены(выполненные работы для данного объекта) и их объемы
2) агрегировать все данные и суммировать, если тип работ совпадает
3) создавать отчёт в екселе в котором будет;
    а) колонка с названием типа работ
   б) колонка тип измерения
   в) количество выполненно
   г) цена для рабочего
   д)  сумма (цена для рабочего умноженная на количество)
   е) в конце таблицы считается Итоговая сумма (колонка сумма)
   ж) после итоговой суммы считаются все выплаты по данному объекту для рабочих   и указываются отдельной строкой которая называется ВЫПЛАЧЕНО
   з) дальше отдельной строкой идет информация ОСТАТКИ К ВЫПЛАТЕ

Копия отчёта так же должна сохраняться в корневой папке проекта под названием report_workers

А так же отчёт должен скачиваться через джанго админку путём выбор экшенс и указания объекта